results/fabio-512-run03/003_fio/cmd_42.output
io_uring_cmd-bdev_xnvme: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=spdk_bdev, iodepth=128
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666794305,
  "timestamp_ms" : 1666794305565,
  "time" : "Wed Oct 26 16:25:05 2022",
  "jobs" : [
    {
      "jobname" : "io_uring_cmd-bdev_xnvme",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring_cmd-bdev_xnvme",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "128",
        "bs" : "512",
        "direct" : "0",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "spdk_bdev",
        "spdk_conf" : "/tmp/spdk_bdev_xnvme_io_uring_cmd.conf",
        "filename" : "Nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 2748871168,
        "io_kbytes" : 2684444,
        "bw_bytes" : 392639789,
        "bw" : 383437,
        "iops" : 766856.877589,
        "runtime" : 7001,
        "total_ios" : 5368765,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 160,
          "max" : 14527,
          "mean" : 230.077360,
          "stddev" : 30.761980,
          "N" : 5368766
        },
        "clat_ns" : {
          "min" : 24817,
          "max" : 392446,
          "mean" : 165054.594933,
          "stddev" : 20731.113871,
          "N" : 5368889,
          "percentile" : {
            "1.000000" : 93696,
            "5.000000" : 128512,
            "10.000000" : 148480,
            "20.000000" : 158720,
            "30.000000" : 160768,
            "40.000000" : 162816,
            "50.000000" : 166912,
            "60.000000" : 168960,
            "70.000000" : 171008,
            "80.000000" : 175104,
            "90.000000" : 181248,
            "95.000000" : 191488,
            "99.000000" : 226304,
            "99.500000" : 248832,
            "99.900000" : 288768,
            "99.950000" : 305152,
            "99.990000" : 342016
          }
        },
        "lat_ns" : {
          "min" : 25097,
          "max" : 392657,
          "mean" : 165284.672416,
          "stddev" : 20730.944214,
          "N" : 5368889
        },
        "bw_min" : 375894,
        "bw_max" : 462948,
        "bw_agg" : 100.000000,
        "bw_mean" : 383510.071429,
        "bw_dev" : 22889.425414,
        "bw_samples" : 14,
        "iops_min" : 751788,
        "iops_max" : 925897,
        "iops_mean" : 767020.357143,
        "iops_stddev" : 45779.089193,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 99.985714,
      "sys_cpu" : 0.000000,
      "ctx" : 22,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 100.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 89.771490,
        "8" : 10.228495,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.100000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.010000,
        "100" : 2.232580,
        "250" : 97.278536,
        "500" : 0.488753,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

io_uring_cmd-bdev_xnvme: (groupid=0, jobs=1): err= 0: pid=16166: Wed Oct 26 16:25:05 2022
  read: IOPS=767k, BW=374MiB/s (393MB/s)(2622MiB/7001msec)
    slat (nsec): min=160, max=14527, avg=230.08, stdev=30.76
    clat (usec): min=24, max=392, avg=165.05, stdev=20.73
     lat (usec): min=25, max=392, avg=165.28, stdev=20.73
    clat percentiles (usec):
     |  1.00th=[   94],  5.00th=[  129], 10.00th=[  149], 20.00th=[  159],
     | 30.00th=[  161], 40.00th=[  163], 50.00th=[  167], 60.00th=[  169],
     | 70.00th=[  172], 80.00th=[  176], 90.00th=[  182], 95.00th=[  192],
     | 99.00th=[  227], 99.50th=[  249], 99.90th=[  289], 99.95th=[  306],
     | 99.99th=[  343]
   bw (  KiB/s): min=375894, max=462948, per=100.00%, avg=383510.07, stdev=22889.43, samples=14
   iops        : min=751788, max=925897, avg=767020.36, stdev=45779.09, samples=14
  lat (usec)   : 50=0.01%, 100=2.23%, 250=97.28%, 500=0.49%
  cpu          : usr=99.99%, sys=0.00%, ctx=22, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=89.8%, 8=10.2%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=5368765,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=374MiB/s (393MB/s), 374MiB/s-374MiB/s (393MB/s-393MB/s), io=2622MiB (2749MB), run=7001-7001msec